import { IoIosArrowForward, IoIosStar } from 'react-icons/io';

export default function RoomDescription() {
  return (
    <>
      <section className="flex flex-col border-b border-neutral-04 py-8">
        <span className="text-2xl">Ganghyeon-myeon, Yangyang, 한국의 별장 전체</span>
        <span className="flex gap-1 pt-1 text-base">
          <span>최대 인원 5명</span>
          <span>·</span>
          <span>침실 2개</span>
          <span>·</span>
          <span>욕실 1.5개</span>
        </span>
        <span className="flex gap-1 text-base">
          <span className="flex items-center gap-1 text-[17px]">
            <IoIosStar />
            4.87
          </span>
          <span>·</span>
          <span className="underline">후기 221개</span>
        </span>
      </section>
      <section className="flex items-center gap-5 border-b border-neutral-04 py-6">
        <div className="h-10 w-10 rounded-full bg-black"></div>
        <div className="flex flex-col">
          <span className="text-base">호스트 : Seowoo 님</span>
          <span className="flex gap-1 text-sm text-neutral-07">
            <span>슈퍼호스트</span>
            <span>·</span>
            <span>호스팅 경력 6년</span>
          </span>
        </div>
      </section>
      <section className="border-b border-neutral-04 py-12">
        <div>
          한옥 대목장인 주인이 직접 지은 독채 한옥스테이 만송재는 모든 목재로 황장목(금강송)을
          사용하여 내부에 들어서는 순간 은은한 솔향기에 취하게 됩니다. 내부의 모든 가구와 소파,
          식탁, 주방의 싱크대까지 소나무와 적삼목인 친환경 원목을 사용하고 벽은 전통한지로 도배를
          하였습니다. 제가 직접 규방공예와 야생화자수 소품으로 꾸민 내부는 고즈넉한 한옥의 운치를
          더한답니다. 거실, 안방(침대), 구들방(온돌), 누마루, 주방, 화장실로 구성돼 있고 안방의 문은
          옛날 궁궐에 사는 공주들이 기거하던 방의 문인 월문으로 만들었는데 자연스러운 곡선이
          멋스럽습니다. 깔끔한 화이트의 100% 면소재 침구는 항상 뽀송뽀송 합니다. 전기 그릴을 사용할
          수 있는 야외바비큐장도 준비되어 있습니다. 방과 연결된 누마루에서는 만송재 정원의 다양한
          야생화를 바라보며 오롯이 한옥의 멋을 느낄 수 있습니다. 건축탐구-집, 한국기행, 생생정보
          등등 다수의 프로그램에 방송된 만송재 입니다.
        </div>
        <div>
          한옥 대목장인 주인이 직접 지은 독채 한옥스테이 만송재는 모든 목재로 황장목(금강송)을
          사용하여 내부에 들어서는 순간 은은한 솔향기에 취하게 됩니다. 내부의 모든 가구와 소파,
          식탁, 주방의 싱크대까지 소나무와 적삼목인 친환경 원목을 사용하고 벽은 전통한지로 도배를
          하였습니다. 제가 직접 규방공예와 야생화자수 소품으로 꾸민 내부는 고즈넉한 한옥의 운치를
          더한답니다. 거실, 안방(침대), 구들방(온돌), 누마루, 주방, 화장실로 구성돼 있고 안방의 문은
          옛날 궁궐에 사는 공주들이 기거하던 방의 문인 월문으로 만들었는데 자연스러운 곡선이
          멋스럽습니다. 깔끔한 화이트의 100% 면소재 침구는 항상 뽀송뽀송 합니다. 전기 그릴을 사용할
          수 있는 야외바비큐장도 준비되어 있습니다. 방과 연결된 누마루에서는 만송재 정원의 다양한
          야생화를 바라보며 오롯이 한옥의 멋을 느낄 수 있습니다. 건축탐구-집, 한국기행, 생생정보
          등등 다수의 프로그램에 방송된 만송재 입니다.
        </div>
        <div>
          한옥 대목장인 주인이 직접 지은 독채 한옥스테이 만송재는 모든 목재로 황장목(금강송)을
          사용하여 내부에 들어서는 순간 은은한 솔향기에 취하게 됩니다. 내부의 모든 가구와 소파,
          식탁, 주방의 싱크대까지 소나무와 적삼목인 친환경 원목을 사용하고 벽은 전통한지로 도배를
          하였습니다. 제가 직접 규방공예와 야생화자수 소품으로 꾸민 내부는 고즈넉한 한옥의 운치를
          더한답니다. 거실, 안방(침대), 구들방(온돌), 누마루, 주방, 화장실로 구성돼 있고 안방의 문은
          옛날 궁궐에 사는 공주들이 기거하던 방의 문인 월문으로 만들었는데 자연스러운 곡선이
          멋스럽습니다. 깔끔한 화이트의 100% 면소재 침구는 항상 뽀송뽀송 합니다. 전기 그릴을 사용할
          수 있는 야외바비큐장도 준비되어 있습니다. 방과 연결된 누마루에서는 만송재 정원의 다양한
          야생화를 바라보며 오롯이 한옥의 멋을 느낄 수 있습니다. 건축탐구-집, 한국기행, 생생정보
          등등 다수의 프로그램에 방송된 만송재 입니다.
        </div>
        <div>
          한옥 대목장인 주인이 직접 지은 독채 한옥스테이 만송재는 모든 목재로 황장목(금강송)을
          사용하여 내부에 들어서는 순간 은은한 솔향기에 취하게 됩니다. 내부의 모든 가구와 소파,
          식탁, 주방의 싱크대까지 소나무와 적삼목인 친환경 원목을 사용하고 벽은 전통한지로 도배를
          하였습니다. 제가 직접 규방공예와 야생화자수 소품으로 꾸민 내부는 고즈넉한 한옥의 운치를
          더한답니다. 거실, 안방(침대), 구들방(온돌), 누마루, 주방, 화장실로 구성돼 있고 안방의 문은
          옛날 궁궐에 사는 공주들이 기거하던 방의 문인 월문으로 만들었는데 자연스러운 곡선이
          멋스럽습니다. 깔끔한 화이트의 100% 면소재 침구는 항상 뽀송뽀송 합니다. 전기 그릴을 사용할
          수 있는 야외바비큐장도 준비되어 있습니다. 방과 연결된 누마루에서는 만송재 정원의 다양한
          야생화를 바라보며 오롯이 한옥의 멋을 느낄 수 있습니다. 건축탐구-집, 한국기행, 생생정보
          등등 다수의 프로그램에 방송된 만송재 입니다.
        </div>
        <div>
          한옥 대목장인 주인이 직접 지은 독채 한옥스테이 만송재는 모든 목재로 황장목(금강송)을
          사용하여 내부에 들어서는 순간 은은한 솔향기에 취하게 됩니다. 내부의 모든 가구와 소파,
          식탁, 주방의 싱크대까지 소나무와 적삼목인 친환경 원목을 사용하고 벽은 전통한지로 도배를
          하였습니다. 제가 직접 규방공예와 야생화자수 소품으로 꾸민 내부는 고즈넉한 한옥의 운치를
          더한답니다. 거실, 안방(침대), 구들방(온돌), 누마루, 주방, 화장실로 구성돼 있고 안방의 문은
          옛날 궁궐에 사는 공주들이 기거하던 방의 문인 월문으로 만들었는데 자연스러운 곡선이
          멋스럽습니다. 깔끔한 화이트의 100% 면소재 침구는 항상 뽀송뽀송 합니다. 전기 그릴을 사용할
          수 있는 야외바비큐장도 준비되어 있습니다. 방과 연결된 누마루에서는 만송재 정원의 다양한
          야생화를 바라보며 오롯이 한옥의 멋을 느낄 수 있습니다. 건축탐구-집, 한국기행, 생생정보
          등등 다수의 프로그램에 방송된 만송재 입니다.
        </div>
        <button
          type="button"
          className="mt-4 flex items-center"
        >
          <span className="underline">더 보기</span>
          <IoIosArrowForward size={19} />
        </button>
      </section>
    </>
  );
}
